; domain
(define (domain block-words)
  (:requirements :strips :typing :equality)
  (:types block)
  (:predicates (on ?x ?y - block)
	       (ontable ?x - block)
	       (clear ?x - block)
	       (handempty)
	       (holding ?x - block)
	       )

  (:action pick-up
	     :parameters (?x - block)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x - block)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y - block)
	     :precondition (and (holding ?x) (clear ?y) (not (= ?x ?y)))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y - block)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty) (not (= ?x ?y)))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem block-words)
	(:domain block-words)
	(:objects
		e r h m o t c u s a - block
	)
	(:init
		(handempty)
		(clear m)
		(on m o)
		(on o e)
		(on e r)
		(ontable r)
		(clear t)
		(on t h)
		(ontable h)
		(clear a)
		(on a c)
		(ontable c)		
		(clear u)
		(ontable u)
		(clear s)
		(ontable s)
	)
	(:goal (and
		;; mother
		(clear m) (ontable r) (on m o) (on o t) (on t h) (on h e) (on e r)
	))
)

; plan
1. (unstack m o)
   deleted: (clear m) (handempty) (on m o)
   added: (holding m) (clear o)
   goals met: 3 of 7
2. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 4 of 7
3. (unstack o e)
   deleted: (clear o) (handempty) (on o e)
   added: (holding o) (clear e)
   goals met: 4 of 7
4. (stack o m)
   deleted: (holding o) (clear m)
   added: (clear o) (handempty) (on o m)
   goals met: 3 of 7
5. (unstack t h)
   deleted: (clear t) (handempty) (on t h)
   added: (holding t) (clear h)
   goals met: 2 of 7
6. (stack t o)
   deleted: (holding t) (clear o)
   added: (clear t) (handempty) (on t o)
   goals met: 2 of 7
7. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 2 of 7
8. (stack h e)
   deleted: (holding h) (clear e)
   added: (clear h) (handempty) (on h e)
   goals met: 3 of 7
9. (unstack t o)
   deleted: (clear t) (handempty) (on t o)
   added: (holding t) (clear o)
   goals met: 3 of 7
10. (stack t h)
   deleted: (holding t) (clear h)
   added: (clear t) (handempty) (on t h)
   goals met: 4 of 7
11. (unstack o m)
   deleted: (clear o) (handempty) (on o m)
   added: (holding o) (clear m)
   goals met: 5 of 7
12. (stack o t)
   deleted: (holding o) (clear t)
   added: (clear o) (handempty) (on o t)
   goals met: 6 of 7
13. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 5 of 7
14. (stack m o)
   deleted: (holding m) (clear o)
   added: (clear m) (handempty) (on m o)
   goals met: 7 of 7
